&После("ПередЗаписью")
Процедура тз_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("тз_ЭтоНовыйПартнер", ЭтоНовый());
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура тз_ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Клиент Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("тз_ЭтоНовыйПартнер") Или Не ДополнительныеСвойства.тз_ЭтоНовыйПартнер Тогда
		Возврат;
	КонецЕсли;
	
	тз_УровниПокупателейСервер.УстановитьБронзовыйНовомуПартнеру(Ссылка, Истина);
	
КонецПроцедуры
